In [69]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# ejercicio 1

In [2]:
alumnos_df = pd.read_csv('pandas.csv', encoding='latin-1')

In [3]:
alumnos_df.head()

   padron     materia  nota      fecha
0       2  Matematica     6  19/3/2018
1       4      Lengua    10   8/3/2018
2       2      Ingles     5  25/4/2018
3       4      Fisica     5   9/1/2018
4       1     Quimica     6   7/4/2018

In [4]:
#se castea la fecha
alumnos_df['fecha'] = pd.to_datetime(alumnos_df['fecha'])

In [5]:
alumnos_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   padron   99 non-null     int64
 1   materia  99 non-null     object
 2   nota     99 non-null     int64
 3   fecha    99 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 3.2+ KB

### promedio de todas las notas

In [6]:
# promedio de todas las notas
alumnos_df['nota'].mean()

5.393939393939394

### la nota mas alta y mas baja del 2019

In [7]:
#la nota mas alta y mas baja del 2019

alumnos_2019 = alumnos_df[(alumnos_df['fecha'] >= '01/01/2019')]

nota_min_2019 = alumnos_2019['nota'].min()
print(nota_min_2019)

nota_max_2019 = alumnos_2019['nota'].max()
print(nota_max_2019)

1
10

In [8]:
#aspectro (?)
alumnos_2019.shape

(45, 4)

### Cuál es el padrón con mayor cantidad de materias aprobadas durante el último cuatrimestre.

In [9]:
alumnos_ultimo_cuatri_aprobados = alumnos_df[ (alumnos_df['fecha'] >= '07/01/2019') &\
                                             (alumnos_df['nota'] >= 4)]

In [10]:
alumnos_ultimo_cuatri_aprobados.head()

    padron  materia  nota      fecha
54       2  Quimica     5 2019-09-05
62       3   Ingles     6 2019-10-04
71       2   Lengua     4 2019-09-05
98       1   Fisica     9 2019-12-03

In [11]:
alumnos_ultimo_cuatri_aprobado_AGRUPADOS = alumnos_ultimo_cuatri_aprobados.groupby(['padron']).agg({'padron':['count']})

In [12]:
alumnos_ultimo_cuatri_aprobado_AGRUPADOS.head()

       padron
        count
padron
1           1
2           2
3           1

In [13]:
level0=alumnos_ultimo_cuatri_aprobado_AGRUPADOS.columns.get_level_values(0)

level1=alumnos_ultimo_cuatri_aprobado_AGRUPADOS.columns.get_level_values(1)

alumnos_ultimo_cuatri_aprobado_AGRUPADOS.columns = level0 + '_' + level1

In [14]:
alumnos_ultimo_cuatri_aprobado_AGRUPADOS=alumnos_ultimo_cuatri_aprobado_AGRUPADOS.reset_index()

In [15]:
alumnos_ultimo_cuatri_aprobado_AGRUPADOS[alumnos_ultimo_cuatri_aprobado_AGRUPADOS['padron_count'] == alumnos_ultimo_cuatri_aprobado_AGRUPADOS['padron_count'].max()]

   padron  padron_count
1       2             2

### Cuál es la nota promedio por materia.

In [16]:
alumnos_df

    padron     materia  nota      fecha
0        2  Matematica     6 2018-03-19
1        4      Lengua    10 2018-08-03
2        2      Ingles     5 2018-04-25
3        4      Fisica     5 2018-09-01
4        1     Quimica     6 2018-07-04
..     ...         ...   ...        ...
94       2     Quimica     8 2019-01-15
95       4  Matematica     1 2019-04-14
96       1      Lengua     8 2019-04-13
97       1      Ingles     2 2019-05-13
98       1      Fisica     9 2019-12-03

[99 rows x 4 columns]

In [17]:
materia_agrupados = alumnos_df.groupby(['materia']).agg({'nota':['mean']})

In [18]:
materia_agrupados

                nota
                mean
materia
Fisica      5.550000
Ingles      5.350000
Lengua      5.450000
Matematica  4.950000
Quimica     5.684211

### Cuál es la nota promedio por padrón.

In [19]:
padron_agrupados = alumnos_df.groupby(['padron']).agg({'nota':['mean']})

In [20]:
padron_agrupados

            nota
            mean
padron
1       5.208333
2       5.413793
3       5.666667
4       5.357143

# ejercicio 2

In [21]:
transacciones_df = pd.read_csv('Tabla Ej2 Pandas.csv', encoding='latin-1')

In [22]:
transacciones_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 751 entries, 0 to 750
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaccion       751 non-null    int64
 1   tipo_transaccion  746 non-null    object
 2   origen            734 non-null    float64
 3   destino           738 non-null    float64
 4   fecha             751 non-null    object
 5   monto             751 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 35.3+ KB

### Validar que todas las transacciones cuenten con un tipo de transacción.

In [29]:

transacciones_df['tipo_transaccion'].isnull().values.any()

True

In [30]:
# borro todos los registros con datos nan
transacciones_df_without_na = transacciones_df.dropna()

In [49]:
transacciones_df_without_na.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 716 entries, 0 to 750
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaccion       716 non-null    int64
 1   tipo_transaccion  716 non-null    object
 2   origen            716 non-null    float64
 3   destino           716 non-null    float64
 4   fecha             716 non-null    object
 5   monto             716 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 59.2+ KB

### Verificar que todas las transacciones del tipo transferencia, depósito y extracción cuenten con montos distintos de cero.

In [39]:
# filtro monto > 0

montos_mayor_a_cero = transacciones_df_without_na[(transacciones_df_without_na['monto'] > 0)]

In [55]:
(montos_mayor_a_cero['monto'] < 0).values.any()

False

### Indicar cuáles fueron las 10 transacciones de mayor monto.

In [59]:
montos_mayor_a_cero.sort_values(by='monto', ascending=False).head(10)

     transaccion tipo_transaccion  origen  destino      fecha  monto
324          325         deposito     6.0      4.0  10/1/2018     10
519          520         deposito     4.0      9.0  26/4/2018     10
236          237    transferencia     7.0      1.0  24/2/2018     10
460          461       extraccion     3.0      9.0  21/2/2018     10
462          463         deposito     1.0      6.0  12/3/2018     10
579          580         deposito    10.0      6.0  10/2/2018     10
89            90    transferencia     8.0      5.0  13/4/2018     10
476          477    transferencia     6.0      6.0  25/4/2018     10
669          670         deposito     3.0      7.0  23/4/2018     10
213          214         deposito     5.0      7.0  15/6/2018     10

### Ejercicio 5

In [14]:
nacimientos_df = pd.read_csv('Tabla 1 Ej5.csv', encoding='latin-1')
hospitales_df = pd.read_csv('Tabla 2 Ej5.csv', encoding='latin-1')

In [15]:
nacimientos_df.head()

   dia_nac  mes_nac  ano_nac  peso_nac  longitud_nac  id_hospital  tipo_parto
0       13       10     2020      4233            85            3           1
1        7        2     2019      2880            91            2           1
2        4        7     2018      4283            90            3           2
3       27        6     2018      2870            97            3           2
4       23       12     2015      4231            92            5           2

In [16]:
hospitales_df.head()

   id_hospital   direccion  promedio_nac_mensuales
0            1  avellaneda                       2
1            2      lugano                       6
2            3      europa                       7
3            4     francia                       4
4            5      italia                       2

In [17]:
nacimientos_oct17_df = nacimientos_df[(nacimientos_df['mes_nac'] == 10) & (nacimientos_df['ano_nac'] == 2017)] 
nacimientos_oct17_df.head()

#montos_mayor_a_cero = transacciones_df_without_na[(transacciones_df_without_na['monto'] > 0)]

,dia_nac,mes_nac,ano_nac,peso_nac,longitud_nac,id_hospital,tipo_parto
93,27,10,2017,2994,88,3,2
211,14,10,2017,3120,93,4,2
233,28,10,2017,4208,84,1,1
291,7,10,2017,3862,98,2,2
456,18,10,2017,3586,88,5,2

In [19]:
nacimientos_oct17_agrup_df = nacimientos_oct17_df.groupby(['id_hospital']).agg({'id_hospital':['count']})
nacimientos_oct17_agrup_df.head(10)

#alumnos_ultimo_cuatri_aprobado_AGRUPADOS = alumnos_ultimo_cuatri_aprobados.groupby(['padron']).agg({'padron':['count']})

            id_hospital
                  count
id_hospital
1                     3
2                     3
3                     1
4                     4
5                     2

In [20]:
level0=nacimientos_oct17_agrup_df.columns.get_level_values(0)

level1=nacimientos_oct17_agrup_df.columns.get_level_values(1)

nacimientos_oct17_agrup_df.columns = level0 + '_' + level1

In [22]:
nacimientos_oct17_agrup_df=nacimientos_oct17_agrup_df.reset_index()

In [24]:
nacimientos_oct17_agrup_df.head()

   index  id_hospital  id_hospital_count
0      0            1                  3
1      1            2                  3
2      2            3                  1
3      3            4                  4
4      4            5                  2

In [42]:

join_df = nacimientos_oct17_agrup_df.merge(hospitales_df, how='inner', left_on=['id_hospital'], right_on=['id_hospital'])[['id_hospital','id_hospital_count', 'promedio_nac_mensuales']]

#df = confirmed.merge(deaths, how='left', left_on=['Province/State', 'Country/Region', 'Lat', 'Long', 'date'], right_on=['Province/State', 'Country/Region', 'Lat', 'Long', 'date'])

In [43]:
join_df.head()

   id_hospital  id_hospital_count  promedio_nac_mensuales
0            1                  3                       2
1            2                  3                       6
2            3                  1                       7
3            4                  4                       4
4            5                  2                       2

In [44]:
join_filtrado_df = join_df[(join_df['id_hospital_count'] > join_df['promedio_nac_mensuales'])]

In [47]:
#Calcular la cantidad de nacimientos para cada uno de los hospitales para el mes de Octubre de 2017 e indicar aquellos hospitales que superan el promedio de nacimientos mensuales.

In [46]:
join_filtrado_df

   id_hospital  id_hospital_count  promedio_nac_mensuales
0            1                  3                       2

In [48]:
nacimientos_df.head()

   dia_nac  mes_nac  ano_nac  peso_nac  longitud_nac  id_hospital  tipo_parto
0       13       10     2020      4233            85            3           1
1        7        2     2019      2880            91            2           1
2        4        7     2018      4283            90            3           2
3       27        6     2018      2870            97            3           2
4       23       12     2015      4231            92            5           2

In [52]:
nacimientos_oct17_df.head()

,dia_nac,mes_nac,ano_nac,peso_nac,longitud_nac,id_hospital,tipo_parto
93,27,10,2017,2994,88,3,2
211,14,10,2017,3120,93,4,2
233,28,10,2017,4208,84,1,1
291,7,10,2017,3862,98,2,2
456,18,10,2017,3586,88,5,2

In [53]:
partos_oct17 = nacimientos_oct17_df[(nacimientos_oct17_df['tipo_parto'] == 2)]

In [66]:
count_partos_oct17 = partos_oct17['tipo_parto'].count()

count_partos_oct17

9

In [50]:
nacimientos_oct16_df = nacimientos_df[(nacimientos_df['mes_nac'] == 10) & (nacimientos_df['ano_nac'] == 2016)] 
nacimientos_oct16_df.head()

,dia_nac,mes_nac,ano_nac,peso_nac,longitud_nac,id_hospital,tipo_parto
37,24,10,2016,2710,92,4,1
126,18,10,2016,3805,80,5,1
146,17,10,2016,3121,83,1,1
170,9,10,2016,3262,91,5,1
182,23,10,2016,4247,86,1,2

In [59]:
partos_oct16 = nacimientos_oct16_df[(nacimientos_oct16_df['tipo_parto'] == 2)]

In [67]:
count_partos_oct16 = partos_oct16['tipo_parto'].count()

count_partos_oct16

13

In [61]:
# Comparando el mes de Octubre de 2017 indicar programáticamente si se incremento el % de cesáreas con respecto a ese mes del año 2016.

In [68]:
count_partos_oct17 > count_partos_oct16

False

### Ejercicio de Parcial Primer Cuatrimestre 2019

In [87]:
autos_df = pd.read_csv('C:/Users/lcsulak/Desktop/python/uba/parcial/2019_1C_tabla1.csv', encoding='latin-1')
ventas_df = pd.read_csv('C:/Users/lcsulak/Desktop/python/uba/parcial/2019_1C_tabla2.csv', encoding='latin-1')

In [88]:
autos_df.head()

  marca  modelo  motor transmision      origen
0  Ford  Mondeo   1700      manual    nacional
1  Ford      Ka   1900      manual  extranjero
2  Ford      Ka   1900      manual    nacional
3  Ford      Ka   1900  automatico  extranjero
4  Ford  Fiesta   1900  automatico    nacional

In [89]:
ventas_df.head()

       marca  modelo      fecha  concesionario
0       Ford  Mondeo  27/4/2018              1
1       Ford      Ka  15/6/2019              7
2       Ford  Fiesta   1/3/2018              2
3  Chevrolet  Meriva  3/12/2016              7
4  Chevrolet   Corsa   6/4/2016              3

In [90]:
ventas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12881 entries, 0 to 12880
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   marca          12881 non-null  object
 1   modelo         12881 non-null  object
 2   fecha          12881 non-null  object
 3   concesionario  12881 non-null  int64
dtypes: int64(1), object(3)
memory usage: 402.7+ KB

In [91]:
#se castea la fecha
ventas_df['fecha'] = pd.to_datetime(ventas_df['fecha'])

In [92]:
ventas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12881 entries, 0 to 12880
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   marca          12881 non-null  object
 1   modelo         12881 non-null  object
 2   fecha          12881 non-null  datetime64[ns]
 3   concesionario  12881 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 402.7+ KB

In [ ]:
#Se desea conocer, para los modelos de origen nacional, cuales son
#los modelos que ya se discontinuaron (un modelo discontinuado es
#aquel que no tuvo ventas en los últimos 12 meses),

In [93]:
autos_nac_df = autos_df[(autos_df['origen'] == 'nacional')]

In [95]:
autos_nac_df.head()

        marca  modelo  motor transmision    origen
0        Ford  Mondeo   1700      manual  nacional
2        Ford      Ka   1900      manual  nacional
4        Ford  Fiesta   1900  automatico  nacional
6   Chevrolet   Corsa   1900      manual  nacional
8  Volkswagen     Gol   1800  automatico  nacional

In [102]:
ventas_disc_df = ventas_df[(ventas_df['fecha'] <= '05/01/2019')]

In [105]:
ventas_disc_df.head()

        marca  modelo      fecha  concesionario
0        Ford  Mondeo 2018-04-27              1
2        Ford  Fiesta 2018-01-03              2
3   Chevrolet  Meriva 2016-03-12              7
4   Chevrolet   Corsa 2016-06-04              3
6  Volkswagen     Gol 2016-02-21              5

In [107]:
join_autos_df = ventas_disc_df.merge(autos_nac_df, how='inner', left_on=['marca', 'modelo'], right_on=['marca', 'modelo'])

#join_df = nacimientos_oct17_agrup_df.merge(hospitales_df, how='inner', left_on=['id_hospital'], right_on=['id_hospital'])[['id_hospital','id_hospital_count', 'promedio_nac_mensuales']]

In [117]:
join_autos_df['marca'].unique()

array(['Ford', 'Chevrolet', 'Volkswagen', 'Fiat'], dtype=object)

In [119]:
#Modelos que nose vendieron los ultimos 12 meses de origen nacional
join_autos_df['modelo'].unique()

array(['Mondeo', 'Fiesta', 'Corsa', 'Gol', 'Fitito', 'Duna', 'Ka'],
      dtype=object)

In [120]:
#obteniendo un nuevo RDD con (marca, modelo, total_vendido,
#fecha_inicio_venta, fecha_discontinuación), donde la
#fecha de discontinuación es la fecha cuando se vendió el último auto
#de ese modelo, ordenado ascendentemente por esta fecha. (***)

In [175]:
autos_agrupados_df = join_autos_df.groupby(['marca', 'modelo']).agg({'marca':['count'],'fecha':['min','max']})

#autos_agrupados_df = join_autos_df.groupby(['marca', 'modelo']).agg({'marca':['count']},{'fecha':['min']})   

#grouped=oscars_short.groupby(['year_of_award'])
#.agg({'age_at_award':['mean','count'],'year_of_birth':'min','religion':['max','min']}) 
#grouped.head(20)

#alumnos_ultimo_cuatri_aprobado_AGRUPADOS = alumnos_ultimo_cuatri_aprobados.groupby(['padron']).agg({'padron':['count']})

In [181]:
autos_agrupados_df.head(10)

                  marca      fecha
                  count        min        max
marca      modelo
Chevrolet  Corsa   1008 2015-01-01 2019-05-01
Fiat       Duna     988 2015-01-02 2019-04-28
           Fitito  3006 2015-01-01 2019-05-01
Ford       Fiesta   997 2015-01-02 2019-05-01
           Ka      1027 2015-01-02 2019-04-30
           Mondeo  1026 2015-01-01 2019-05-01
Volkswagen Gol     1015 2015-01-04 2019-05-01

In [182]:
autos_agrupados_df.reset_index(level='class')

KeyError: 'Level class not found'

In [173]:
autos_agrupados_df = join_autos_df.groupby(['marca', 'modelo'])['marca'].count().rename('cantidad')

#Da eror el siguiente:
#autos_agrupados_df = join_autos_df.groupby(['marca', 'modelo'])['marca'].count().rename('cantidad')['fecha'].min().rename('fechamin')


autos_agrupados2_df=autos_agrupados_df.reset_index()
#df3 = df2.groupby(['Country/Region', 'Lat', 'Long', 'date'])['confirmed','recovered','deaths'].sum()
#df3 = df3.reset_index()

#tt_totals = tt_msgs[((tt_msgs['anio'] == '2020') & (tt_msgs['mes'] == '4'))].groupby(['anio','mes','id_pager'])['dia'].agg(['count']).reset_index() 
#autos_agrupadosnuevo_df = join_autos_df.                                    groupby(['marca', 'modelo']).agg({'marca':['count'],'fecha':['min','max']}).reset_index()

In [174]:
autos_agrupados2_df.head()

       marca  modelo  cantidad
0  Chevrolet   Corsa      1008
1       Fiat    Duna       988
2       Fiat  Fitito      3006
3       Ford  Fiesta       997
4       Ford      Ka      1027

In [152]:
autos_agrupadosnuevo_df.head()

       marca  modelo marca      fecha
                     count        min        max
0  Chevrolet   Corsa  1008 2015-01-01 2019-05-01
1       Fiat    Duna   988 2015-01-02 2019-04-28
2       Fiat  Fitito  3006 2015-01-01 2019-05-01
3       Ford  Fiesta   997 2015-01-02 2019-05-01
4       Ford      Ka  1027 2015-01-02 2019-04-30

In [141]:
level0=autos_agrupados_df.columns.get_level_values(0)

level1=autos_agrupados_df.columns.get_level_values(1)

autos_agrupados_df.columns = level0 + '_' + level1

In [143]:
autos_agrupados_df=autos_agrupados_df.reset_index()

In [144]:
autos_agrupados_df.head(10)

   index       marca  modelo  marca_count  fecha_min  fecha_max
0      0   Chevrolet   Corsa         1008 2015-01-01 2019-05-01
1      1        Fiat    Duna          988 2015-01-02 2019-04-28
2      2        Fiat  Fitito         3006 2015-01-01 2019-05-01
3      3        Ford  Fiesta          997 2015-01-02 2019-05-01
4      4        Ford      Ka         1027 2015-01-02 2019-04-30
5      5        Ford  Mondeo         1026 2015-01-01 2019-05-01
6      6  Volkswagen     Gol         1015 2015-01-04 2019-05-01

In [146]:
autos_agrupados_df.sort_values(by='fecha_max')


#montos_mayor_a_cero.sort_values(by='monto', ascending=False).head(10)

   index       marca  modelo  marca_count  fecha_min  fecha_max
1      1        Fiat    Duna          988 2015-01-02 2019-04-28
4      4        Ford      Ka         1027 2015-01-02 2019-04-30
0      0   Chevrolet   Corsa         1008 2015-01-01 2019-05-01
2      2        Fiat  Fitito         3006 2015-01-01 2019-05-01
3      3        Ford  Fiesta          997 2015-01-02 2019-05-01
5      5        Ford  Mondeo         1026 2015-01-01 2019-05-01
6      6  Volkswagen     Gol         1015 2015-01-04 2019-05-01